#include <iostream>
#include "Set.h"

int main(){
    
    return 0;
}
// 1. Оголошення класу та атрибутів
    // клас Set, що представляє множину символів n
    // атрибут для зберігання символів множини

// 2. Реалізувати кілька конструкторів
    // конструктор за замовчуванням
    // конструктор, що приймає масив символів для ініціалізації множини

// 3. Метод перевірки належності елемента
    // метод, який приймає символ і перевіряє, чи входить він до множини

// 4. Метод операцій над множинами
    // реалізуйти метод, який приймає інший об'єкт класу Set і повертає нову множину, що складається з елементів, які є в обох множинах
    // реалізуйти метод, який приймає інший об'єкт класу Set і повертає нову множину, що містить всі елементи з обох множин без дублювання
    // реалізуйти метод, що повертає нову множину, яка містить елементи, що є у першій множині, але відсутні у другій
// 5. Створити масив(список) множин
    // масив (список) об'єктів класу Set для представлення кількох множин одночасно

// 6. Функція побудови нової множини
    // функція, яка приймає дві множини і створює нову множину з елементів, які входять тільки в одну з цих множин
